src_ext/DataProcessors/УЗ_РассылкаДолжникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_РассылкаДолжникам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Оповещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_СписаниеОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ГрафикРабочегоВремениПедагога</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачислениеБонусов</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_КаналыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_КаналыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WhatsApp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/DataProcessors/УЗ_РассылкаДолжникам/Ext/ManagerModule.bsl
//Рассылка должникам (просили покупатели на Инфостарте, 28.09.2026): письмо о задолженности ученикам организации
//вручную — список должников (УЗ_Сервер.ДолжникиИНачалоДолга: одно правило с оповещением о долге и диаграммой),
//отбор по сумме и сроку долга, текст с подстановками, предпросмотр, отправка через УЗ_Почта (песочница тестов
//соблюдается: отправка идёт только через УЗ_Почта.Отправить) и журнал писем (УЗ_ЖурналРассылки).
//Повтор: ученику в организации письмо не уходит чаще «не чаще, чем раз в N дней» — по журналу, где и письма
//регламентного оповещения о долге (В27), и по дате письма в оповещении о долге. Регламентное оповещение смотрит
//в тот же журнал — ручная рассылка и оповещение друг друга не дублируют.
//Сообщение — ученику и плательщикам, у кого в карточке отмечено «Согласие на сообщения», каждому его каналом (почта,
//Telegram, SMS, WhatsApp — УЗ_Сообщения, В47): письмо — по тексту формы, SMS и мессенджеры — коротким текстом шаблона
//«Задолженность» настроек сообщений; сумма при отправке пересчитывается на сервере — список мог устареть.
//Права: руководитель и менеджер (как в типовых УНФ: письма клиентам — работа менеджера); настройки почты — только
//администратор, журнал менеджер только читает.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Параметры рассылки по умолчанию. Структура: Организация, МинимальнаяСумма, ДолгСтаршеДней, НеЧащеДней, Тема, Шаблон.
Функция ПараметрыПоУмолчанию() Экспорт

	Настройки = УЗ_Сервер.ПолучитьНастройки();
	Параметры = Новый Структура("Организация, МинимальнаяСумма, ДолгСтаршеДней, НеЧащеДней, Тема, Шаблон");
	Параметры.Организация = УЗ_Сервер.ОрганизацияОстатков();
	Параметры.МинимальнаяСумма = 0;
	Параметры.ДолгСтаршеДней = 0;
	Параметры.НеЧащеДней = ?(Настройки.ОповещатьОЗадолженности > 0, Настройки.ОповещатьОЗадолженности, 7);
	Параметры.Тема = НСтр("ru = 'Задолженность за занятия'");
	Параметры.Шаблон = ШаблонПоУмолчанию();
	Возврат Параметры;

КонецФункции

//Текст письма по умолчанию. Подстановки — см. Подстановки.
Функция ШаблонПоУмолчанию() Экспорт

	Возврат НСтр("ru = 'Здравствуйте!
		|
		|По занятиям ученика [Ученик] ([Предмет]) задолженность [Сумма] руб.
		|Организация: [Организация].
		|Пожалуйста, пополните баланс при следующем посещении.
		|
		|Если вы уже оплатили, просто не обращайте внимания на это письмо.'");

КонецФункции

//Подстановки текста и темы письма (для подсказки на форме и справки).
Функция Подстановки() Экспорт

	Возврат "[Ученик], [Сумма], [Предмет], [Организация], [ДнейДолга]";

КонецФункции

//Должники для рассылки на сейчас (серверное время).
//  Параметры — Структура: Организация (пустая — все организации), МинимальнаяСумма, ДолгСтаршеДней (0 — любой),
//    НеЧащеДней.
//Массив структур: Ученик, Организация, Долг, Предметы (строка), НачалоДолга, ДнейДолга, Адреса (строка "; "),
//ПоследнееПисьмо, МожноПисать (Булево), Причина (почему письма не будет: нет адреса / писали недавно).
Функция Должники(Параметры) Экспорт

	Сейчас = ТекущаяДатаСеанса();
	НеЧащеДней = Макс(1, Параметры.НеЧащеДней);
	Все = УЗ_Сервер.ДолжникиИНачалоДолга();
	Отобранные = Новый Массив;
	Ученики = Новый Массив;
	Для Каждого СтрокаДолга Из Все Цикл
		Если ЗначениеЗаполнено(Параметры.Организация) И СтрокаДолга.Организация <> Параметры.Организация Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаДолга.Долг < Параметры.МинимальнаяСумма Тогда
			Продолжить;
		КонецЕсли;
		ДнейДолга = ?(ЗначениеЗаполнено(СтрокаДолга.НачалоДолга), Цел((Сейчас - СтрокаДолга.НачалоДолга) / 86400), 0);
		Если Параметры.ДолгСтаршеДней > 0 И ЗначениеЗаполнено(СтрокаДолга.НачалоДолга)
			И ДнейДолга < Параметры.ДолгСтаршеДней Тогда
			Продолжить;
		КонецЕсли;
		Отобранные.Добавить(Новый Структура("СтрокаДолга, ДнейДолга", СтрокаДолга, ДнейДолга));
		Если Ученики.Найти(СтрокаДолга.Клиент) = Неопределено Тогда
			Ученики.Добавить(СтрокаДолга.Клиент);
		КонецЕсли;
	КонецЦикла;

	Письма = ПоследниеПисьма(Ученики);
	Итог = Новый Массив;
	Для Каждого Отобранный Из Отобранные Цикл
		СтрокаДолга = Отобранный.СтрокаДолга;
		Должник = Новый Структура("Ученик, Организация, Долг, Предметы, НачалоДолга, ДнейДолга, Адреса,
			|ПоследнееПисьмо, МожноПисать, Причина");
		Должник.Ученик = СтрокаДолга.Клиент;
		Должник.Организация = СтрокаДолга.Организация;
		Должник.Долг = СтрокаДолга.Долг;
		Должник.НачалоДолга = СтрокаДолга.НачалоДолга;
		Должник.ДнейДолга = Отобранный.ДнейДолга;
		ЗаполнитьСостояние(Должник, Письма, НеЧащеДней, Сейчас);
		Итог.Добавить(Должник);
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Письмо должнику по шаблону. Структура: Адреса (Массив — e-mail, телефоны, чаты Telegram получателей), Тема, Текст.
//  Должник — структура строки (см. Должники): Ученик, Организация, Долг, Предметы, ДнейДолга.
Функция ПодготовитьПисьмо(Должник, Тема, Шаблон) Экспорт

	Адреса = Новый Массив;
	Для Каждого Получатель Из УЗ_Сообщения.Получатели(Должник.Ученик, УЗ_Сообщения.ГотовностьКаналов(Истина)) Цикл
		Если Получатель.МожноПисать И Адреса.Найти(Получатель.Адрес) = Неопределено Тогда
			Адреса.Добавить(Получатель.Адрес);
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("Адреса, Тема, Текст", Адреса, ПодставитьЗначения(Тема, Должник),
		ПодставитьЗначения(Шаблон, Должник));

КонецФункции

//Отправить письма должникам. Каждому — заново на сервере: долг на сейчас (погашен — не пишем), адреса с согласием,
//повтор не чаще НеЧащеДней по журналу писем; каждая попытка — в журнал писем.
//  Получатели — массив структур Ученик, Организация (отмеченные строки формы).
//Массив структур: Ученик, Организация, Сумма, Отправлено, Результат (строка для формы).
Функция ОтправитьПисьма(Получатели, Тема, Шаблон, НеЧащеДней) Экспорт

	ПроверитьВозможностьОтправки();
	Сейчас = ТекущаяДатаСеанса();
	НеЧащеДней = Макс(1, НеЧащеДней);
	Ученики = Новый Массив;
	Для Каждого Получатель Из Получатели Цикл
		Ученики.Добавить(Получатель.Ученик);
	КонецЦикла;
	Долги = УЗ_Сервер.ДолжникиИНачалоДолга(Ученики);
	Письма = ПоследниеПисьма(Ученики);
	ЦиклОтправки = УЗ_Сообщения.НовыйЦикл();

	Итог = Новый Массив;
	Для Каждого Получатель Из Получатели Цикл
		Результат = Новый Структура("Ученик, Организация, Сумма, Отправлено, Результат", Получатель.Ученик,
			Получатель.Организация, 0, Ложь, "");
		Итог.Добавить(Результат);
		Найдено = Долги.НайтиСтроки(Новый Структура("Клиент, Организация", Получатель.Ученик, Получатель.Организация));
		Если Найдено.Количество() = 0 Тогда
			Результат.Результат = НСтр("ru = 'Не отправлено: долга уже нет'");
			Продолжить;
		КонецЕсли;
		Должник = Новый Структура("Ученик, Организация, Долг, Предметы, НачалоДолга, ДнейДолга, Адреса,
			|ПоследнееПисьмо, МожноПисать, Причина");
		Должник.Ученик = Получатель.Ученик;
		Должник.Организация = Получатель.Организация;
		Должник.Долг = Найдено[0].Долг;
		Должник.НачалоДолга = Найдено[0].НачалоДолга;
		Должник.ДнейДолга = ?(ЗначениеЗаполнено(Должник.НачалоДолга), Цел((Сейчас - Должник.НачалоДолга) / 86400), 0);
		ЗаполнитьСостояние(Должник, Письма, НеЧащеДней, Сейчас);
		Результат.Сумма = Должник.Долг;
		Если Не Должник.МожноПисать Тогда
			Результат.Результат = НСтр("ru = 'Не отправлено:'") + " " + Должник.Причина;
			Продолжить;
		КонецЕсли;
		Отправка = УЗ_Сообщения.ОтправитьОЗадолженности(ЦиклОтправки, Должник, Тема, Шаблон, Истина);
		Результат.Отправлено = Отправка.Отправлено;
		ТекстОшибки = Отправка.ТекстОшибки;
		Если Результат.Отправлено Тогда
			Результат.Результат =
				СтрШаблон(НСтр("ru = 'Отправлено %1'"), Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM.yyyy HH:mm'"))
				+ ?(Отправка.ОтправленоВсем, "", "; " + НСтр("ru = 'не всем:'") + " " + ТекстОшибки);
			//второй раз в этой же рассылке (ученик отмечен дважды) — уже «писали недавно»
			Письма.Вставить(РегистрыСведений.УЗ_ЖурналРассылки.КлючПисьма(Должник.Ученик, Должник.Организация), Сейчас);
		Иначе
			Результат.Результат = НСтр("ru = 'Ошибка:'") + " " + ТекстОшибки;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Почему отправить нельзя ("" — можно): безопасный режим (с тем, как его снять) или не настроен ни один канал (почта,
//Telegram, SMS, WhatsApp) — тогда причина почты, как до 2.2.
//  УчитыватьПесочницу — в песочнице почты (тесты на копиях) письмо наружу не уходит вовсе, безопасный режим ей не
//  помеха: проверяется только настройка почты. Ложь — ответ, как для обычного сеанса.
Функция ПричинаНевозможностиОтправки(УчитыватьПесочницу = Истина) Экспорт

	Если УЗ_Общий.БезопасныйРежимДействует() И Не (УчитыватьПесочницу И УЗ_Почта.ПесочницаВключена()) Тогда
		Возврат УЗ_Сообщения.ТекстБезопасногоРежима();
	КонецЕсли;
	Для Каждого Канал Из УЗ_Сообщения.Каналы() Цикл
		Если Канал <> Перечисления.УЗ_КаналыСообщений.Почта
			И ПустаяСтрока(УЗ_Сообщения.ПричинаНеготовностиКанала(Канал)) Тогда
			Возврат "";
		КонецЕсли;
	КонецЦикла;
	Причина = "";
	Если Не УЗ_Почта.ПочтаНастроена(Причина) Тогда
		Возврат Причина + " "
			+ НСтр("ru = 'Почту настраивает администратор: Учёт занятий — Настройки — Настройки почты.'");
	КонецЕсли;
	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьОтправки()

	Если Не ПравоДоступа("Использование", Метаданные.Обработки.УЗ_РассылкаДолжникам) Тогда
		ВызватьИсключение НСтр("ru = 'Нет права на рассылку должникам.'");
	КонецЕсли;
	Причина = ПричинаНевозможностиОтправки();
	Если Не ПустаяСтрока(Причина) Тогда
		ВызватьИсключение Причина;
	КонецЕсли;

КонецПроцедуры

//Последние письма: журнал писем (ручная рассылка и регламентное оповещение) и дата письма в оповещении о долге
//(письма версий до журнала). Соответствие КлючПисьма → дата.
Функция ПоследниеПисьма(Ученики)

	Письма = РегистрыСведений.УЗ_ЖурналРассылки.ПоследниеПисьма(Ученики);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оповещения.Источник КАК Ученик,
	|	Оповещения.Организация КАК Организация,
	|	МАКСИМУМ(Оповещения.ДатаПисьма) КАК Дата
	|ИЗ
	|	РегистрСведений.УЗ_Оповещения КАК Оповещения
	|ГДЕ
	|	Оповещения.Источник В(&Ученики)
	|	И Оповещения.ДатаПисьма > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Оповещения.Источник,
	|	Оповещения.Организация";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = РегистрыСведений.УЗ_ЖурналРассылки.КлючПисьма(Выборка.Ученик, Выборка.Организация);
		Дата = Письма.Получить(Ключ);
		Если Дата = Неопределено Или Дата < Выборка.Дата Тогда
			Письма.Вставить(Ключ, Выборка.Дата);
		КонецЕсли;
	КонецЦикла;
	Возврат Письма;

КонецФункции

//Предметы долга, адреса, последнее письмо и можно ли писать сейчас.
Процедура ЗаполнитьСостояние(Должник, Письма, НеЧащеДней, Сейчас)

	Предметы = Новый Массив;
	Для Каждого СтрокаОстатка Из УЗ_Сервер.ОстаткиДенегУченика(Должник.Ученик) Цикл
		Если СтрокаОстатка.Организация = Должник.Организация И СтрокаОстатка.Остаток < 0
			И ЗначениеЗаполнено(СтрокаОстатка.ПредметОбучения) Тогда
			Предметы.Добавить(Строка(СтрокаОстатка.ПредметОбучения));
		КонецЕсли;
	КонецЦикла;
	Должник.Предметы = СтрСоединить(Предметы, ", ");
	Адреса = Новый Массив;
	Причины = Новый Массив;
	Для Каждого Получатель Из УЗ_Сообщения.Получатели(Должник.Ученик, УЗ_Сообщения.ГотовностьКаналов(Истина)) Цикл
		Если Получатель.МожноПисать Тогда
			Адреса.Добавить(?(Получатель.Канал = Перечисления.УЗ_КаналыСообщений.Почта, Получатель.Адрес,
				СтрШаблон("%1: %2", Получатель.Канал, Получатель.Адрес)));
		ИначеЕсли Получатель.Причина <> НСтр("ru = 'нет согласия на сообщения'") Тогда
			Причины.Добавить(Получатель.Представление);
		КонецЕсли;
	КонецЦикла;
	Должник.Адреса = СтрСоединить(Адреса, "; ");
	Последнее = Письма.Получить(РегистрыСведений.УЗ_ЖурналРассылки.КлючПисьма(Должник.Ученик, Должник.Организация));
	Должник.ПоследнееПисьмо = ?(Последнее = Неопределено, '00010101', Последнее);
	Должник.МожноПисать = Ложь;
	Если Адреса.Количество() = 0 Тогда
		Должник.Причина = УЗ_Сообщения.ТекстНекому()
			+ ?(Причины.Количество() = 0, "", " (" + СтрСоединить(Причины, "; ") + ")");
	ИначеЕсли ЗначениеЗаполнено(Должник.ПоследнееПисьмо) И Сейчас - Должник.ПоследнееПисьмо < НеЧащеДней * 86400 Тогда
		Должник.Причина = СтрШаблон(НСтр("ru = 'письмо было %1, следующее — не раньше %2'"),
			Формат(Должник.ПоследнееПисьмо, "ДФ=dd.MM.yyyy"),
				Формат(Должник.ПоследнееПисьмо + НеЧащеДней * 86400, "ДФ=dd.MM.yyyy"));
	Иначе
		Должник.МожноПисать = Истина;
		Должник.Причина = "";
	КонецЕсли;

КонецПроцедуры

Функция ПодставитьЗначения(Знач Текст, Должник)

	Текст = СтрЗаменить(Текст, "[Ученик]", Строка(Должник.Ученик));
	Текст = СтрЗаменить(Текст, "[Сумма]", Формат(Должник.Долг, "ЧДЦ=2; ЧН=0"));
	Текст = СтрЗаменить(Текст, "[Предмет]",
		?(ПустаяСтрока(Должник.Предметы), НСтр("ru = 'занятия'"), Должник.Предметы));
	Текст = СтрЗаменить(Текст, "[Организация]", Строка(Должник.Организация));
	Текст = СтрЗаменить(Текст, "[ДнейДолга]", Формат(Должник.ДнейДолга, "ЧГ=0; ЧН=0"));
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
